benchmark/results/ceiling-20260601-211459/srv10_wrk2_c200.txt
Running 10s test @ http://127.0.0.1:8080/json
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.68ms  424.96us   7.04ms   67.07%
    Req/Sec    59.43k     7.68k   81.87k    67.82%
  Latency Distribution
     50%    1.88ms
     75%    2.04ms
     90%    2.08ms
     99%    2.32ms
  1193928 requests in 10.10s, 138.91MB read
Requests/sec: 118196.54
Transfer/sec:     13.75MB